package book.chapter6;

/**
 * Определите класс в пакете. Создайте экземпляр класса за пределами пакета.
 */
public class Class1 {
    public static void hello(){
        System.out.println("hello world!");
    }
}
