'''
Два друга движутся навстречу с заданной скоростью. 
Скорость первого 1 м/с, второго 2 м/с.
У них есть собака, которая бегает со скоростью 5 м/с.
Когда друзья начинают свой путь, собака бежит от одного друга к другому,
добегает, разворачивается и тут же бежит обратно.
Сколько раз собака перебежит от одного друга к другому, пока они не встретятся?

Формулы:
S - расстояние
V - скорость
T - время
V = S / T
S = V * T
T = S / V

Переменные:
count - сколько раз собака пробежала от одного друга к другому
distance - расстояние
firstFriendSpeed - скорость первого друга
secondFriendSpeed - скорость второго друга
dogSpeed - скорость собаки
friend - друг (первый или второй)
'''

distance = 1000
count = 0
firstFriendSpeed = 1
secondFriendSpeed = 2
dogSpeed = 5
T = 0

while distance > 10:
    T += 1
    distance -= firstFriendSpeed + secondFriendSpeed
    if dogSpeed * T > distance:
        count += 1
        T = 0

print("Собака пробежала от одного друга к другому", count, "раз")