package book.chapter4;

/**
 * Напишите программу, которая выводит числа от 1 до 100.
 */
public class Numbers {
    public static void main(String[] args) {
        for (int i = 1; i <= 100; i++)
            System.out.println(i);
    }
}
