import java.util.Scanner;

/**
 * По возвращению с кофе-брейка Ваня задумался — а можно ли было обойтись
 * меньшим числом движений, будь нож Вани бесконечно длинным (иначе говоря, если
 * он мог бы сделать сколько угодно разрезов за раз, если эти разрезы лежат на
 * одной прямой)? Считается, что места для разрезов намечены заранее, и все
 * разрезы делаются с ювелирной точностью.
 * 
 * Оказывается, что можно. Например, если Ваня хотел бы разделить рулет на 4
 * части, он мог бы обойтись двумя разрезами — сначала он разделил бы рулет
 * на две половинки, а потом совместил бы две половинки и разрезал обе пополам
 * одновременно.
 * 
 * Вам дано число N, требуется сказать, каким минимальным числом разрезов можно
 * обойтись.
 * public class Main {
 */

public class Task2 {
    public static void main(String[] args) {
        Scanner scan = new Scanner(System.in);
        int n = scan.nextInt();
        scan.close();
        if (n > 1)
            System.out.println(Integer.toBinaryString(n - 1).length());
        else
            System.out.println(0);
    }
}
