package book.chapter3;

/**
 * Выведите наибольшее и наименьшее число в экспоненциальной записи для типов
 * float и double.
 */
public class ExpMinMax {
    public static void main(String[] args) {
        System.out.println(Float.MIN_VALUE);
        System.out.println(Float.MAX_VALUE);
        System.out.println(Double.MIN_VALUE);
        System.out.println(Double.MAX_VALUE);
    }
}
